import json
import base64
import requests
import os

txt2img_url = r'http://0.0.0.0:7861/sdapi/v1/txt2img'

# 发送请求
def submit_post(url: str, data: dict):
    return requests.post(url, data=json.dumps(data))

# 解码并保存图片
def save_encoded_image(b64_image: str, output_path: str):
    with open(output_path, 'wb') as image_file:
        image_file.write(base64.b64decode(b64_image))

def encode_image(image_path):
    with open(image_path, "rb") as image_file:
        return base64.b64encode(image_file.read()).decode('utf-8')

def generate_avatar(base_img_path, output_path):
    data = {
        "alwayson_scripts": {
            "controlnet": {
                "args": [
                    {
                        "model": "control_v11f1p_sd15_depth [cfd03158]",
                        "module": "none",
                        "weight": 1.5,
                        "enabled": True,
                        "low_vram": "false",
                        "resize_mode": "Crop and Resize",
                        "control_mode": "Balanced",
                        "guidance_end": 0.9,
                        "pixel_perfect": "true",
                        "processor_res": 512,
                        "guidance_start": 0,
                        "image": encode_image(base_img_path)
                    }
                ]
            }
        },
        "batch_size": 1,
        "cfg_scale": 7,
        "height": 512,
        "negative_prompt": "worst quality, low quality:2, monochrome, watermark, easynegative, sketch, ugly, text, logo, bad_prompt, bad-picture-chill-75v, nsfw, bad_prompt,, overexposure,",
        "override_settings": {
            "sd_model_checkpoint": "ReVAnimated_v122_V122.safetensors [f8bb2922e1]",
            "sd_vae": "vae-ft-mse-840000-ema-pruned.safetensors"
        },
        "clip_skip": 2,
        "prompt": "liquid,silver,simple background,gradient background,gloss,shadow,(white_background:1.2),3d objects, <lora:yt_20241111165853:0.8>,, masterpiece, realistic, ultra-fine painting, extreme detail description, Professional, extremely detailed CG unity 8k wallpaper, official art, best quality",
        "restore_faces": True,
        "sampler_index": "Euler a",
        "sampler_name": "",
        "script_args": [],
        "seed": 1236591058,
        "steps": 20,
        "tiling": True,
        "width": 512,
        "enable_hr": True,
        "hr_scale": 2,
        "hr_upscaler": "R-ESRGAN 4x+",
        "hr_second_pass_steps": 1,
        "denoising_strength":0.3
    }

    response = submit_post(txt2img_url, data)
    save_image_path = os.path.join(output_path, f"{os.path.splitext(os.path.basename(base_img_path))[0]}.png")
    save_encoded_image(response.json()['images'][0], save_image_path)


character_list = ['赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','泰','龙','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邬','喻','柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','俞','任','袁','柳','酆','鲍','史','唐','费','廉','岑','薛','雷','贺','倪','汤','滕','殷','罗','毕','郝','安','常','乐','手','时','傅','皮','卞','齐','康','伍','余','元','卜','顾','孟','平','黄','和','穆','萧','尹','姚','邵','湛','汪','祁','毛','禹','狄','米','贝','明','臧','计','伏','成','戴','谈','宋','茅','庞','熊','纪','舒','屈','项','祝','董','梁','杜','阮','蓝','闵','席','季','麻','强','贾','路','娄','危','江','童','颜','郭','梅','盛','林','刁','锺','徐','邱','骆','高','夏','蔡','田','樊','胡','凌','霍','虞','万','支','柯','咎','管','卢','莫','经','房','裘','缪','干','解','应','宗','丁','宣','责','邓','郁','单','杭','洪','包','诸','左','石','崔','吉','钮','龚','程','稀','邢','滑','装','陆','荣','翁','荀','羊','於','惠','甄','麴','家','封','芮','羿','储','靳','汲','邴','糜','松','井','段','富','巫','乌','焦','巴','号','牧','隗','山','谷','车','侯','这','蓬','全','都','班','仰','秋','仲','伊','宫','宁','仇','來','暴','甘','钭','历','我','祖','武','符','刘','景','詹','束','叶','幸','司','韶','郜','黎','蓟','溥','印','宿','白','怀','蒲','邰','从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙','池','不','阳','胥','能','苍','双','闻','莘','党','翟','谭','贡','劳','逢','姬','申','扶','堵','冉','宰','郦','雍','却','璩','桑','桂','濮','牛','寿','通','边','扈','燕','冀','僪','浦','尚','农','温','别','庄','晏','柴','瞿','阎','充','慕','连','茹','习','宝','艾','鱼','容','向','古','易','慎','戈','廖','庾','终','暨','居','衡','步','耿','满','弘','匡','国','文','寇','广','禄','阙','东','欧','殳','利','蔚','越','夔','隆','师','巩','厍','聂','晁','勾','敖','融','冷','眥','辛','那','简','饶','空','曾','毋','沙','也','养','鞠','须','丰','巢','关','蒯','相','查','后','荆','红','游','权','逮','盍','益','桓','公','寸','贰','皇','侨','彤','竭','端','赫','实','甫','集','象','翠','狂','辟','典','良','函','芒','苦','其','京','中','夕','税','荤','靖','绪','愈','硕','牢','买','但','巧','枚','撒','秘','亥','绍','以','森','斋','释','奕','姒','朋','求','羽','用','占','真','穰','鹃','间','漆','贵','代','贯','旁','崇','栋','告','休','褒','谏','镜','皋','因','在','歧','禾','示','是','委','钊','频','赢','呼','大','威','昂','律','冒','保','系','抄','定','化','莱','校','么','抗','祢','綦','悟','宏','功','庚','务','敏','捷','拱','兆','丑','丙','畅','苟','随','类','卯','候','友','答','己','允','甲','留','尾','佼','玄','乘','裔','延','植','环','矫','赛','昔','待','度','旷','遇','偶','前','由','寒','敛','受','袭','衅','叔','圣','御','夫','仆','镇','藩','邸','府','掌','首','员','焉','戏','可','智','尔','凭','悉','进','笃','厚','仁','业','肇','资','合','仍','九','衷','哀','刑','俎','仵','圭','夷','徭','蛮','汗','孛','乾','姑','罕','洛','淦','洋','邶','郸','郯','邗','邛','剑','虢','隋','蒿','茆','营','树','桐','锁','钟','机','盘','铎','斛','玉','线','针','箕','庹','绳','磨','蒉','瓮','弭','刀','疏','牵','浑','恽','势','世','仝','同','蚁','止','戢','睢','洗','种','涂','肖','泣','潜','卷','脱','谡','蹉','赧','浮','顿','说','次','错','念','夙','斯','完','丹','表','聊','源','姓','吾','导','展','出','闭','才','无','书','学','愚','本','性','雪','霜','烟','少','字','桥','板','斐','独','诗','嘉','扬','善','揭','祈','析','赤','紫','青','柔','刚','奇','拜','佛','陀','弥','阿','素','长','僧','隐','仙','隽','宇','祭','酒','淡','塔','琦','闪','始','星','南','天','接','波','碧','速','禚','腾','潮','似','澄','潭','謇','纵','渠','奈','风','舂','濯','沐','茂','英','兰','檀','藤','枝','检','生','折','登','驹','骑','貊','虎','肥','鹿','雀','野','禽','飞','节','宜','鲜','粟','栗','豆','帛','官','布','衣','藏','钞','银','门','盈','庆','喜','及','普','建','巨','望','希','道','载','声','漫','犁','力','贸','勤','革','改','兴','亓','睦','修','信','北','守','坚','勇','汉','练','尉','士','旅','五','令','将','旗','军','行','奉','敬','恭','仪','母','堂','丘','义','礼','慈','孝','理','伦','卿','问','永','辉','位','让','尧','依','犹','介','承','市','所','苑','杞','剧','第','零','谌','招','续','达','忻','六','郵','战','迟','宛','励','粘','萨','邝','覃','辜','初','楼','城','区','局','台','原','考','妫','纳','泉','老','清','德','卑','过','麦','曲','召','有','舜','丛','岳','之','章','佳','那','拉','冠','宾','香','果','蹇','称','诺','来','多','繁','朴','回','毓','竹','百','福','言','佟','爱','年','笪','谯','哈','墨','赏','伯','佴','佘','牟','商','琴','况','亢','缑','帅','海','归','钦','鄢','汝','法','闫','楚','晋','父','夹','督','仉','盖','逯','库','郏','阴','薄','厉','稽','开','光','操','瑞','眭','泥','运','摩','伟','铁','迮']
for character in character_list:
    print(f'generate ing :{character}')
    generate_avatar(f"/mnt/workspace/sd/base_img/{character}.png", "/mnt/workspace/sd/output")

print('end')
